{
  "input_authors": [
    "UminJoEAAAAJ"
  ],
  "author_names": {
    "UminJoEAAAAJ": "Hani Altwaijry",
    "UA9Hb2EAAAAJ": "Andreas Veit",
    "OKZC1CYAAAAJ": "Eduard Trulls",
    "kzFmAkYAAAAJ": "Pascal Fua",
    "vjZrDKQAAAAJ": "James Hays",
    "yBS07YQAAAAJ": "Aqil M Azmi",
    "dkELewQAAAAJ": "Mohammad Moghimi",
    "pr6rIJEAAAAJ": "Kwang Moo Yi",
    "iAEBIB4AAAAJ": "Francesc Moreno-Noguer",
    "h0a5q3QAAAAJ": "Vincent Lepetit",
    "ZO3Ek1gAAAAJ": "Iasonas Kokkinos",
    "ZFRhP04AAAAJ": "Alberto Sanfeliu",
    "2bDu3ecAAAAJ": "Edgar Simo-Serra",
    "1RmD-YsAAAAJ": "Andrea Tagliasacchi",
    "OsqGLUAAAAAJ": "Wei Jiang (蒋炜)",
    "qsB2vcgAAAAJ": "Jan Hosang",
    "CZ40rFYAAAAJ": "Michal Tyszkiewicz",
    "oAYi1YQAAAAJ": "Yuhe Jin",
    "n-B0jr4AAAAJ": "Mathieu Salzmann",
    "H72QiF0AAAAJ": "Dmytro Mishkin",
    "EJCNY6QAAAAJ": "Jiri Matas",
    "DCUAYxwAAAAJ": "Andreu Corominas Murtra",
    "vOSVVdkAAAAJ": "Patrick Ebel",
    "NTozWbQAAAAJ": "Juan Andrade-Cetto",
    "dDiJhKMAAAAJ": "Gonzalo Ferrer",
    "4hC_FYoAAAAJ": "Stavros Tsogkas",
    "RQip5VgAAAAJ": "Simon Lynen",
    "2fAUgfAAAAAJ": "Paul-Edouard Sarlin",
    "LbHIswMAAAAJ": "Josep M. Mirats Tur",
    "XXC5tSEAAAAJ": "Weiwei Sun (孙卫卫)",
    "xq2A-7sAAAAJ": "Anastasiia Mishchuk",
    "chD5XxkAAAAJ": "Serge Belongie",
    "08CNqrYAAAAJ": "Sanjiv Kumar",
    "U0_ab4cAAAAJ": "Ankit Singh Rawat",
    "li4mEfcAAAAJ": "Aditya Krishna Menon",
    "OAtUvx0AAAAJ": "Kimberly Wilber",
    "0v5utcwAAAAJ": "Ayan Chakrabarti",
    "qYLOPxoAAAAJ": "Sadeep Jayasumana",
    "70lgwYwAAAAJ": "Sashank J. Reddi",
    "w0OodaEAAAAJ": "Daniel Glasner",
    "bpSF_9EAAAAJ": "Srinadh Bhojanapalli",
    "bqL73OkAAAAJ": "Abhinav Gupta",
    "rArDMRMAAAAJ": "Neil Alldrin",
    "Wk2gAZUAAAAJ": "Gal Chechik",
    "3_WYcR4AAAAJ": "Deborah Estrin",
    "_MfoOC8AAAAJ": "Eugene Bagdasarian",
    "ING38FQAAAAJ": "Yiqing Hua",
    "lYvF6cUAAAAJ": "Felix Xinnan Yu",
    "6m1ptOgAAAAJ": "Srikumar Ramalingam",
    "eyCw9goAAAAJ": "Suvrit Sra",
    "8NudxYsAAAAJ": "Jingzhao Zhang",
    "9sNvmo4AAAAJ": "Lukáš Neumann",
    "P_luG3cAAAAJ": "David Rolnick",
    "Am6f2DsAAAAJ": "Daliang Li",
    "cLZLZCQAAAAJ": "Michal Lukasik",
    "vQa7heEAAAAJ": "Chen Sun",
    "MxxZkEcAAAAJ": "Kevin Murphy",
    "4QvYJ00AAAAJ": "Vittorio Ferrari",
    "Z8bnyvIAAAAJ": "Victor Gomes",
    "Sc2tw28AAAAJ": "Tom J Duerig",
    "wKJeOQoAAAAJ": "Sai Praneeth Karimireddy",
    "JtrH9jQAAAAJ": "Himanshu Jain",
    "QCARd5gAAAAJ": "Thomas Unterthiner",
    "zrxafGsAAAAJ": "Theofanis Karaletsos",
    "iP5m52IAAAAJ": "Yin Cui",
    "_kElCmMAAAAJ": "Guandao Yang",
    "icbo4M0AAAAJ": "Julian McAuley",
    "xY1GdVgAAAAJ": "Sean Bell",
    "Rh16nsIAAAAJ": "Kavita Bala",
    "-qSroKoAAAAJ": "Balázs Kovács",
    "A33FhJMAAAAJ": "Manzil Zaheer",
    "85bt-X0AAAAJ": "Hans-Arno Jacobsen",
    "1XGC4GsAAAAJ": "Xun Huang",
    "Y4XkdPQAAAAJ": "Nilanjan Chakraborty",
    "VWv6a9kAAAAJ": "Katia Sycara",
    "BHS1vd4AAAAJ": "Christoph Goebel",
    "zDhPcpUAAAAJ": "Baoguang Shi",
    "ohIxH_QAAAAJ": "Yin-Wen Chang",
    "KDqGTIUAAAAJ": "Maximilian Nickel",
    "6GDfcqEAAAAJ": "Laurens van der Maaten",
    "zkhHirIAAAAJ": "Michael S. Bernstein",
    "TAa45rUAAAAJ": "Rajan Vaish",
    "BDYIAe4AAAAJ": "James Davis",
    "IcqahyAAAAAJ": "Ranjay Krishna",
    "6DVk_M0AAAAJ": "Isay Katsman",
    "Bj1tRlsAAAAJ": "François Fleuret",
    "G7cEGOIAAAAJ": "Christoph Strecha",
    "weicM8wAAAAJ": "Kevin Smith",
    "2maWWboAAAAJ": "Helge Rhodin",
    "EX3OYP4AAAAJ": "Sabine Süsstrunk",
    "GPusciUAAAAJ": "Daniel Thalmann",
    "jyxO2akAAAAJ": "Raquel Urtasun",
    "ELOVd8sAAAAJ": "Slobodan Ilic",
    "tG0ow2UAAAAJ": "Raphael Sznitman",
    "njOmQFsAAAAJ": "David J Fleet",
    "_PhjyLoAAAAJ": "Olivier Faugeras",
    "BxbKTYkAAAAJ": "Dimitris Samaras",
    "dq987eIAAAAJ": "Hatim Aboalsamh",
    "Qg47-BsAAAAJ": "Prof Amir Hussain",
    "xyynWKcAAAAJ": "Muhammad Hussain",
    "2PjwQIgAAAAJ": "Abdulrakeeb M. Al-Ssulami",
    "jNw9F-cAAAAJ": "Huda Abdulrahman Al-muzaini",
    "ZIvockAAAAAJ": "Abeer Alsaiari",
    "DV7JWVsAAAAJ": "Richard Byrd"
  },
  "co_authors": {
    "UminJoEAAAAJ": [
      "UA9Hb2EAAAAJ",
      "OKZC1CYAAAAJ",
      "kzFmAkYAAAAJ",
      "vjZrDKQAAAAJ",
      "yBS07YQAAAAJ",
      "dkELewQAAAAJ"
    ],
    "OKZC1CYAAAAJ": [
      "pr6rIJEAAAAJ",
      "kzFmAkYAAAAJ",
      "iAEBIB4AAAAJ",
      "h0a5q3QAAAAJ",
      "ZO3Ek1gAAAAJ",
      "ZFRhP04AAAAJ",
      "2bDu3ecAAAAJ",
      "1RmD-YsAAAAJ",
      "OsqGLUAAAAAJ",
      "qsB2vcgAAAAJ",
      "CZ40rFYAAAAJ",
      "oAYi1YQAAAAJ",
      "n-B0jr4AAAAJ",
      "H72QiF0AAAAJ",
      "EJCNY6QAAAAJ",
      "DCUAYxwAAAAJ",
      "vOSVVdkAAAAJ",
      "NTozWbQAAAAJ",
      "UminJoEAAAAJ",
      "vjZrDKQAAAAJ",
      "dDiJhKMAAAAJ",
      "4hC_FYoAAAAJ",
      "RQip5VgAAAAJ",
      "2fAUgfAAAAAJ",
      "LbHIswMAAAAJ",
      "XXC5tSEAAAAJ",
      "xq2A-7sAAAAJ"
    ],
    "vjZrDKQAAAAJ": [],
    "UA9Hb2EAAAAJ": [
      "chD5XxkAAAAJ",
      "08CNqrYAAAAJ",
      "U0_ab4cAAAAJ",
      "li4mEfcAAAAJ",
      "OAtUvx0AAAAJ",
      "0v5utcwAAAAJ",
      "qYLOPxoAAAAJ",
      "70lgwYwAAAAJ",
      "w0OodaEAAAAJ",
      "bpSF_9EAAAAJ",
      "bqL73OkAAAAJ",
      "rArDMRMAAAAJ",
      "Wk2gAZUAAAAJ",
      "3_WYcR4AAAAJ",
      "_MfoOC8AAAAJ",
      "ING38FQAAAAJ",
      "lYvF6cUAAAAJ",
      "6m1ptOgAAAAJ",
      "eyCw9goAAAAJ",
      "8NudxYsAAAAJ",
      "EJCNY6QAAAAJ",
      "9sNvmo4AAAAJ",
      "P_luG3cAAAAJ",
      "Am6f2DsAAAAJ",
      "cLZLZCQAAAAJ",
      "vQa7heEAAAAJ",
      "MxxZkEcAAAAJ",
      "4QvYJ00AAAAJ",
      "Z8bnyvIAAAAJ",
      "Sc2tw28AAAAJ",
      "wKJeOQoAAAAJ",
      "JtrH9jQAAAAJ",
      "QCARd5gAAAAJ",
      "zrxafGsAAAAJ",
      "iP5m52IAAAAJ",
      "_kElCmMAAAAJ",
      "icbo4M0AAAAJ",
      "xY1GdVgAAAAJ",
      "Rh16nsIAAAAJ",
      "-qSroKoAAAAJ",
      "A33FhJMAAAAJ",
      "85bt-X0AAAAJ",
      "1XGC4GsAAAAJ",
      "Y4XkdPQAAAAJ",
      "VWv6a9kAAAAJ",
      "BHS1vd4AAAAJ",
      "UminJoEAAAAJ",
      "zDhPcpUAAAAJ",
      "ohIxH_QAAAAJ",
      "KDqGTIUAAAAJ",
      "6GDfcqEAAAAJ",
      "zkhHirIAAAAJ",
      "TAa45rUAAAAJ",
      "BDYIAe4AAAAJ",
      "IcqahyAAAAAJ",
      "6DVk_M0AAAAJ"
    ],
    "dkELewQAAAAJ": [],
    "kzFmAkYAAAAJ": [
      "h0a5q3QAAAAJ",
      "n-B0jr4AAAAJ",
      "Bj1tRlsAAAAJ",
      "G7cEGOIAAAAJ",
      "weicM8wAAAAJ",
      "2maWWboAAAAJ",
      "EX3OYP4AAAAJ",
      "iAEBIB4AAAAJ",
      "GPusciUAAAAJ",
      "jyxO2akAAAAJ",
      "ELOVd8sAAAAJ",
      "tG0ow2UAAAAJ",
      "njOmQFsAAAAJ",
      "_PhjyLoAAAAJ",
      "BxbKTYkAAAAJ"
    ],
    "yBS07YQAAAAJ": [
      "dq987eIAAAAJ",
      "Qg47-BsAAAAJ",
      "xyynWKcAAAAJ",
      "2PjwQIgAAAAJ",
      "jNw9F-cAAAAJ",
      "ZIvockAAAAAJ",
      "DV7JWVsAAAAJ",
      "UminJoEAAAAJ"
    ]
  },
  "author_abstracts": {
    "UminJoEAAAAJ": [
      {
        "title": "Learning to Detect and Match Keypoints with Deep Architectures",
        "abstract": "Feature detection and description is a pivotal step in many computer vision pipelines. Traditionally, human engineered features have been the main workhorse in this domain. In this paper, we present a novel approach for learning to detect and describe keypoints from images leveraging deep architectures. To allow for a learning based approach, we collect a large-scale dataset of patches with matching multiscale keypoints. The proposed model learns from this vast dataset to identify and describe meaningful keypoints. We evaluate our model for the effectiveness of its learned representations for detecting multiscale keypoints and describing their respective support regions.",
        "year": 2016,
        "authors": "Hani Altwaijry and Andreas Veit and Serge Belongie"
      },
      {
        "title": "Learning to match aerial images with deep attentive architectures",
        "abstract": "Image matching is a fundamental problem in Computer Vision. In the context of feature-based matching, SIFT and its variants have long excelled in a wide array of applications. However, for ultra-wide baselines, as in the case of aerial images captured under large camera rotations, the appearance variation goes beyond the reach of SIFT and RANSAC. In this paper we propose a data-driven, deep learning-based approach that sidesteps local correspondence by framing the problem as a classification task. Furthermore, we demonstrate that local correspondences can still be useful. To do so we incorporate an attention mechanism to produce a set of probable matches, which allows us to further increase performance. We train our models on a dataset of urban aerial imagery consisting ofsame'anddifferent'pairs, collected for this purpose, and characterize the problem via a human study with annotations from Amazon Mechanical Turk. We demonstrate that our models outperform the state-of-the-art on ultra-wide baseline matching and approach human accuracy.",
        "year": 2016,
        "authors": "Hani Altwaijry and Eduard Trulls and James Hays and Pascal Fua and Serge Belongie"
      },
      {
        "title": "Relative Ranking of Facial Attractiveness",
        "abstract": "Automatic evaluation of human facial attractiveness is a challenging problem that has received relatively little attention from the computer vision community. Previous work in this area have posed attractiveness as a classification problem. However, for applications that require fine-grained relationships between objects, learning to rank has been shown to be superior over the direct interpretation of classifier scores as ranks [27]. In this paper, we propose and implement a personalized relative beauty ranking system. Given training data of faces sorted based on a subject's personal taste, we learn how to rank novel faces according to that person's taste. Using a blend of Facial Geometric Relations, HOG, GIST, L*a*b* Color Histograms, and Dense-SIFT + PCA feature types, our system achieves an average accuracy of 63% on pairwise comparisons of novel test faces. We examine the effectiveness of our method …",
        "year": 2013,
        "authors": "Hani Altwaijry and Serge Belongie"
      }
    ],
    "OKZC1CYAAAAJ": [
      {
        "title": "Lift: Learned invariant feature transform",
        "abstract": "We introduce a novel Deep Network architecture that implements the full feature point handling pipeline, that is, detection, orientation estimation, and feature description. While previous works have successfully tackled each one of these problems individually, we show how to learn to do all three in a unified manner while preserving end-to-end differentiability. We then demonstrate that our Deep pipeline outperforms state-of-the-art methods on a number of benchmark datasets, without the need of retraining.",
        "year": 2016,
        "authors": "Kwang Moo Yi and Eduard Trulls and Vincent Lepetit and Pascal Fua"
      },
      {
        "title": "Discriminative learning of deep convolutional feature point descriptors",
        "abstract": "Deep learning has revolutionalized image-level tasks such as classification, but patch-level tasks, such as correspondence, still rely on hand-crafted features, eg SIFT. In this paper we use Convolutional Neural Networks (CNNs) to learn discriminant patch representations and in particular train a Siamese network with pairs of (non-) corresponding patches. We deal with the large number of potential pairs with the combination of a stochastic sampling of the training set and an aggressive mining strategy biased towards patches that are hard to classify. By using the L2 distance during both training and testing we develop 128-D descriptors whose euclidean distances reflect patch similarity, and which can be used as a drop-in replacement for any task involving SIFT. We demonstrate consistent performance gains over the state of the art, and generalize well against scaling and rotation, perspective transformation, non-rigid deformation, and illumination changes. Our descriptors are efficient to compute and amenable to modern GPUs, and are publicly available.",
        "year": 2015,
        "authors": "Edgar Simo-Serra and Eduard Trulls and Luis Ferraz and Iasonas Kokkinos and Pascal Fua and Francesc Moreno-Noguer"
      },
      {
        "title": "Learning to find good correspondences",
        "abstract": "We develop a deep architecture to learn to find good correspondences for wide-baseline stereo. Given a set of putative sparse matches and the camera intrinsics, we train our network in an end-to-end fashion to label the correspondences as inliers or outliers, while simultaneously using them to recover the relative pose, as encoded by the essential matrix. Our architecture is based on a multi-layer perceptron operating on pixel coordinates rather than directly on the image, and is thus simple and small. We introduce a novel normalization technique, called Context Normalization, which allows us to process each data point separately while embedding global information in it, and also makes the network invariant to the order of the correspondences. Our experiments on multiple challenging datasets demonstrate that our method is able to drastically improve the state of the art with little training data.",
        "year": 2018,
        "authors": "Kwang Moo Yi and Eduard Trulls and Yuki Ono and Vincent Lepetit and Mathieu Salzmann and Pascal Fua"
      }
    ],
    "vjZrDKQAAAAJ": [
      {
        "title": "Microsoft coco: Common objects in context",
        "abstract": "We present a new dataset with the goal of advancing the state-of-the-art in object recognition by placing the question of object recognition in the context of the broader question of scene understanding. This is achieved by gathering images of complex everyday scenes containing common objects in their natural context. Objects are labeled using per-instance segmentations to aid in precise object localization. Our dataset contains photos of 91 objects types that would be easily recognizable by a 4 year old. With a total of 2.5 million labeled instances in 328k images, the creation of our dataset drew upon extensive crowd worker involvement via novel user interfaces for category detection, instance spotting and instance segmentation. We present a detailed statistical analysis of the dataset in comparison to PASCAL, ImageNet, and SUN. Finally, we provide baseline performance analysis for bounding box and …",
        "year": 2014,
        "authors": "Tsung-Yi Lin and Michael Maire and Serge Belongie and James Hays and Pietro Perona and Deva Ramanan and Piotr Dollár and C Lawrence Zitnick"
      },
      {
        "title": "Sun database: Large-scale scene recognition from abbey to zoo",
        "abstract": "Scene categorization is a fundamental problem in computer vision. However, scene understanding research has been constrained by the limited scope of currently-used databases which do not capture the full variety of scene categories. Whereas standard databases for object categorization contain hundreds of different classes of objects, the largest available dataset of scene categories contains only 15 classes. In this paper we propose the extensive Scene UNderstanding (SUN) database that contains 899 categories and 130,519 images. We use 397 well-sampled categories to evaluate numerous state-of-the-art algorithms for scene recognition and establish new bounds of performance. We measure human scene classification performance on the SUN database and compare this with computational methods. Additionally, we study a finer-grained scene representation to detect scenes embedded inside of larger …",
        "year": 2010,
        "authors": "Jianxiong Xiao and James Hays and Krista A Ehinger and Aude Oliva and Antonio Torralba"
      }
    ],
    "UA9Hb2EAAAAJ": [
      {
        "title": "How to backdoor federated learning",
        "abstract": "Federated models are created by aggregating model updates submittedby participants. To protect confidentiality of the training data, the aggregator by design has no visibility into how these updates aregenerated. We show that this makes federated learning vulnerable to amodel-poisoning attack that is significantly more powerful than poisoningattacks that target only the training data. A single or multiple malicious participants can use modelreplacement to introduce backdoor functionality into the joint model, eg, modify an image classifier so that it assigns an attacker-chosenlabel to images with certain features, or force a word predictor tocomplete certain sentences with an attacker-chosen word. We evaluatemodel replacement under different assumptions for the standardfederated-learning tasks and show that it greatly outperformstraining-data poisoning. Federated learning employs secure aggregation to protect confidentialityof participants’ local models and thus cannot detect anomalies inparticipants’ contributions to the joint model. To demonstrate thatanomaly detection would not have been effective in any case, we alsodevelop and evaluate a generic constrain-and-scale technique thatincorporates the evasion of defenses into the attacker’s loss functionduring training.",
        "year": 2020,
        "authors": "Eugene Bagdasaryan and Andreas Veit and Yiqing Hua and Deborah Estrin and Vitaly Shmatikov"
      },
      {
        "title": "Residual networks behave like ensembles of relatively shallow networks",
        "abstract": "In this work we propose a novel interpretation of residual networks showing that they can be seen as a collection of many paths of differing length. Moreover, residual networks seem to enable very deep networks by leveraging only the short paths during training. To support this observation, we rewrite residual networks as an explicit collection of paths. Unlike traditional models, paths through residual networks vary in length. Further, a lesion study reveals that these paths show ensemble-like behavior in the sense that they do not strongly depend on each other. Finally, and most surprising, most paths are shorter than one might expect, and only the short paths are needed during training, as longer paths do not contribute any gradient. For example, most of the gradient in a residual network with 110 layers comes from paths that are only 10-34 layers deep. Our results reveal one of the key characteristics that seem to enable the training of very deep networks: Residual networks avoid the vanishing gradient problem by introducing short paths which can carry gradient throughout the extent of very deep networks.",
        "year": 2016,
        "authors": "Andreas Veit and Michael J Wilber and Serge Belongie"
      }
    ],
    "dkELewQAAAAJ": [
      {
        "title": "Static task scheduling using genetic algorithm and reinforcement learning",
        "abstract": "Task scheduling in a multiprocessor system is defined as assigning a set of tasks to a set of processors. The goal is to minimize the execution time while meeting a set of constraints. A wide variety set of deterministic and heuristic methods are proposed to solve the problem. The main problem is that the proposed methods cannot deal with big search spaces and cannot guarantee to find the optimal solution. In this research a novel approach based on reinforcement learning and genetic algorithm is proposed. Being divided using genetic algorithm, the smaller problems can be solved with reinforcement learner scheduler. The result of the method is a set of task processor pairs. Simulation results in standard problem set show that the method outperforms some studied GA based scheduling methods",
        "year": 2007,
        "authors": "Mohammad Moghimi Najafabadi and Mustafa Zali and Shamim Taheri and Fattaneh Taghiyareh"
      }
    ],
    "kzFmAkYAAAAJ": [
      {
        "title": "SLIC Superpixels Compared to State-of-the-art Superpixel Methods",
        "abstract": "Computer vision applications have come to rely increasingly on superpixels in recent years, but it is not always clear what constitutes a good superpixel algorithm. In an effort to understand the benefits and drawbacks of existing methods, we empirically compare five state-of-the-art superpixel algorithms for their ability to adhere to image boundaries, speed, memory efficiency, and their impact on segmentation performance. We then introduce a new superpixel algorithm, simple linear iterative clustering (SLIC), which adapts a k-means clustering approach to efficiently generate superpixels. Despite its simplicity, SLIC adheres to boundaries as well as or better than previous methods. At the same time, it is faster and more memory efficient, improves segmentation performance, and is straightforward to extend to supervoxel generation.",
        "year": 2012,
        "authors": "Radhakrishna Achanta and Appu Shaji and Kevin Smith and Aurelien Lucchi and Pascal Fua and Sabine Süsstrunk"
      },
      {
        "title": "Brief: Binary robust independent elementary features",
        "abstract": "We propose to use binary strings as an efficient feature point descriptor, which we call BRIEF.We show that it is highly discriminative even when using relatively few bits and can be computed using simple intensity difference tests. Furthermore, the descriptor similarity can be evaluated using the Hamming distance, which is very efficient to compute, instead of the L 2 norm as is usually done.As a result, BRIEF is very fast both to build and to match. We compare it against SURF and U-SURF on standard benchmarks and show that it yields a similar or better recognition performance, while running in a fraction of the time required by either.",
        "year": 2010,
        "authors": "Michael Calonder and Vincent Lepetit and Christoph Strecha and Pascal Fua"
      },
      {
        "title": "Epnp: An accurate o (n) solution to the pnp problem",
        "abstract": "We propose a non-iterative solution to the PnP problem—the estimation of the pose of a calibrated camera from n 3D-to-2D point correspondences—whose computational complexity grows linearly with n. This is in contrast to state-of-the-art methods that are O(n 5) or even O(n 8), without being more accurate. Our method is applicable for all n≥4 and handles properly both planar and non-planar configurations. Our central idea is to express the n 3D points as a weighted sum of four virtual control points. The problem then reduces to estimating the coordinates of these control points in the camera referential, which can be done in O(n) time by expressing these coordinates as weighted sum of the eigenvectors of a 12×12 matrix and solving a small constant number of quadratic equations to pick the right weights. Furthermore, if maximal precision is required, the output of the closed …",
        "year": 2009,
        "authors": "Vincent Lepetit and Francesc Moreno-Noguer and Pascal Fua"
      }
    ],
    "yBS07YQAAAAJ": [
      {
        "title": "Arabic tweets sentiment analysis–a hybrid scheme",
        "abstract": "The fact that people freely express their opinions and ideas in no more than 140 characters makes Twitter one of the most prevalent social networking websites in the world. Being popular in Saudi Arabia, we believe that tweets are a good source to capture the public’s sentiment, especially since the country is in a fractious region. Going over the challenges and the difficulties that the Arabic tweets present – using Saudi Arabia as a basis – we propose our solution. A typical problem is the practice of tweeting in dialectical Arabic. Based on our observation we recommend a hybrid approach that combines semantic orientation and machine learning techniques. Through this approach, the lexical-based classifier will label the training data, a time-consuming task often prepared manually. The output of the lexical classifier will be used as training data for the SVM machine learning classifier. The experiments show that …",
        "year": 2016,
        "authors": "Haifa K Aldayel and Aqil M Azmi"
      },
      {
        "title": "Automated Text Simplification: A Survey",
        "abstract": "Text simplification (TS) reduces the complexity of the text to improve its readability and understandability, while possibly retaining its original information content. Over time, TS has become an essential tool in helping those with low literacy levels, non-native learners, and those struggling with various types of reading comprehension problems. In addition, it is used in a preprocessing stage to enhance other NLP tasks. This survey presents an extensive study of current research studies in the field of TS, as well as covering resources, corpora, and evaluation methods that have been used in those studies.",
        "year": 2021,
        "authors": "Suha S Al-Thanyyan and Aqil M Azmi"
      },
      {
        "title": "Impact of stemming and word embedding on deep learning-based Arabic text categorization",
        "abstract": "Document classification is a classical problem in information retrieval, and plays an important role in a variety of applications. Automatic document classification can be defined as content-based assignment of one or more predefined categories to documents. Many algorithms have been proposed and implemented to solve this problem in general, however, classifying Arabic documents is lagging behind similar works in other languages. In this paper, we present seven deep learning-based algorithms to classify the Arabic documents. These are: Convolutional Neural Network (CNN), CNN-LSTM (LSTM = Long Short-Term Memory), CNN-GRU (GRU = Gated Recurrent Units), BiLSTM (Bidirectional LSTM), BiGRU, Att-LSTM (Attention-based LSTM), and Att-GRU. And for word representation, we applied the word embedding technique (Word2Vec). We tested our approach on two large datasets-with six and eight …",
        "year": 2020,
        "authors": "Huda Abdulrahman Almuzaini and Aqil M Azmi"
      }
    ]
  },
  "author_levels": {
    "input_authors": [
      "UminJoEAAAAJ"
    ],
    "direct_co_authors": [
      "OKZC1CYAAAAJ",
      "vjZrDKQAAAAJ",
      "UA9Hb2EAAAAJ",
      "dkELewQAAAAJ",
      "kzFmAkYAAAAJ",
      "yBS07YQAAAAJ"
    ],
    "second_level_co_authors": [
      "Z8bnyvIAAAAJ",
      "Wk2gAZUAAAAJ",
      "ING38FQAAAAJ",
      "9sNvmo4AAAAJ",
      "_kElCmMAAAAJ",
      "li4mEfcAAAAJ",
      "h0a5q3QAAAAJ",
      "vQa7heEAAAAJ",
      "jyxO2akAAAAJ",
      "JtrH9jQAAAAJ",
      "ZIvockAAAAAJ",
      "0v5utcwAAAAJ",
      "qsB2vcgAAAAJ",
      "Rh16nsIAAAAJ",
      "8NudxYsAAAAJ",
      "GPusciUAAAAJ",
      "kzFmAkYAAAAJ",
      "P_luG3cAAAAJ",
      "qYLOPxoAAAAJ",
      "H72QiF0AAAAJ",
      "VWv6a9kAAAAJ",
      "A33FhJMAAAAJ",
      "4QvYJ00AAAAJ",
      "85bt-X0AAAAJ",
      "BHS1vd4AAAAJ",
      "_PhjyLoAAAAJ",
      "ZFRhP04AAAAJ",
      "cLZLZCQAAAAJ",
      "oAYi1YQAAAAJ",
      "6m1ptOgAAAAJ",
      "zDhPcpUAAAAJ",
      "chD5XxkAAAAJ",
      "icbo4M0AAAAJ",
      "6GDfcqEAAAAJ",
      "Qg47-BsAAAAJ",
      "bqL73OkAAAAJ",
      "tG0ow2UAAAAJ",
      "-qSroKoAAAAJ",
      "2maWWboAAAAJ",
      "dDiJhKMAAAAJ",
      "QCARd5gAAAAJ",
      "eyCw9goAAAAJ",
      "U0_ab4cAAAAJ",
      "iP5m52IAAAAJ",
      "BDYIAe4AAAAJ",
      "Am6f2DsAAAAJ",
      "CZ40rFYAAAAJ",
      "Y4XkdPQAAAAJ",
      "bpSF_9EAAAAJ",
      "KDqGTIUAAAAJ",
      "LbHIswMAAAAJ",
      "Sc2tw28AAAAJ",
      "2PjwQIgAAAAJ",
      "IcqahyAAAAAJ",
      "wKJeOQoAAAAJ",
      "DCUAYxwAAAAJ",
      "OAtUvx0AAAAJ",
      "2bDu3ecAAAAJ",
      "NTozWbQAAAAJ",
      "lYvF6cUAAAAJ",
      "RQip5VgAAAAJ",
      "_MfoOC8AAAAJ",
      "1RmD-YsAAAAJ",
      "6DVk_M0AAAAJ",
      "OsqGLUAAAAAJ",
      "xq2A-7sAAAAJ",
      "rArDMRMAAAAJ",
      "EX3OYP4AAAAJ",
      "MxxZkEcAAAAJ",
      "3_WYcR4AAAAJ",
      "1XGC4GsAAAAJ",
      "08CNqrYAAAAJ",
      "weicM8wAAAAJ",
      "70lgwYwAAAAJ",
      "2fAUgfAAAAAJ",
      "ohIxH_QAAAAJ",
      "jNw9F-cAAAAJ",
      "zrxafGsAAAAJ",
      "EJCNY6QAAAAJ",
      "ELOVd8sAAAAJ",
      "dq987eIAAAAJ",
      "BxbKTYkAAAAJ",
      "iAEBIB4AAAAJ",
      "xY1GdVgAAAAJ",
      "DV7JWVsAAAAJ",
      "UminJoEAAAAJ",
      "pr6rIJEAAAAJ",
      "vjZrDKQAAAAJ",
      "vOSVVdkAAAAJ",
      "Bj1tRlsAAAAJ",
      "njOmQFsAAAAJ",
      "zkhHirIAAAAJ",
      "4hC_FYoAAAAJ",
      "G7cEGOIAAAAJ",
      "XXC5tSEAAAAJ",
      "TAa45rUAAAAJ",
      "n-B0jr4AAAAJ",
      "xyynWKcAAAAJ",
      "w0OodaEAAAAJ",
      "ZO3Ek1gAAAAJ"
    ]
  },
  "summary": {
    "total_authors": 104,
    "input_authors_count": 1,
    "direct_co_authors_count": 6,
    "second_level_co_authors_count": 100,
    "authors_with_abstracts": 7,
    "total_abstracts": 17
  }
}